Tekla Open API Reference for Tekla Structures 2025
AnalysisLoadGroup.LoadGroupTypeEnum Enumeration
 The types of load groups.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum LoadGroupTypeEnum
Public Enumeration LoadGroupTypeEnum
Members
Member name | Value | Description
NOT_DEFINED | 0 |  The load group has not been defined.
LOADM_DEFAULT_GROUP | 1000 |  The default load group.
LOADM_SELF_WEIGHT_EC | 1001 |  The Eurocode self weight type.
LOADM_PERMANENT_LOAD_EC | 1002 |  The Eurocode permanent load type.
LOADM_PRE_STRESS_LOAD_EC | 1003 |  The Eurocode pre-stress load type.
LOADM_LIVE_LOAD_HOUSING_EC | 1004 |  The Eurocode live load housing type.
LOADM_LIVE_LOAD_PUBLIC_BUILDINGS_EC | 1005 |  The Eurocode live load public buildings type.
LOADM_LIVE_LOAD_THEATRES_RESTAURANTS_EC | 1006 |  The Eurocode live load theatres, restaurants type.
LOADM_LIVE_LOAD_WAREHOUSES_EC | 1007 |  The Eurocode live load warehouses type.
LOADM_LIVE_LOAD_STORAGE_BUILDINGS_EC | 1008 |  The Eurocode live load storage buildings type.
LOADM_TRAFFIC_LOAD_LIGHT_VEHICLES_EC | 1009 |  The Eurocode traffic load light vehicles type.
LOADM_TRAFFIC_LOAD_HEAVY_VEHICLES_EC | 1010 |  The Eurocode traffic load heavy vehicles type.
LOADM_TRAFFIC_LOAD_ROOFS_EC | 1011 |  The Eurocode traffic load roofs type.
LOADM_SNOW_LOAD_EC | 1012 |  The Eurocode snow load type.
LOADM_WIND_LOAD_EC | 1013 |  The Eurocode wind load type.
LOADM_FORCES_DUE_TO_TEMPERATURE_EFFECTS_EC | 1014 |  The Eurocode forces due to temperature effects type.
LOADM_IMPERFECTION_LOAD_DUE_TO_DEAD_LOADS_EC | 1015 |  The Eurocode imperfection load due to dead loads type.
LOADM_IMPERFECTION_LOAD_DUE_TO_LIVE_LOADS_EC | 1016 |  The Eurocode imperfection load due to live loads type.
LOADM_IMPERFECTION_LOAD_DUE_TO_SNOW_LOADS_EC | 1017 |  The Eurocode imperfection load due to snow loads type.
LOADM_ACCIDENTAL_LOAD_EC | 1018 |  The Eurocode accidental load type.
LOADM_EARTHQUAKE_LOAD_EC | 1019 |  The Eurocode earthquake load type.
LOADM_DEAD_LOAD_ALONE_BS | 2001 |  The British code dead load alone type.
LOADM_DEADLOAD_BS | 2002 |  The British code dead load type.
LOADM_IMPOSED_LOAD_BS | 2003 |  The British code imposed load type.
LOADM_WIND_LOAD_BS | 2004 |  The British code wind load type.
LOADM_TEMPERATURE_LOAD_BS | 2005 |  The British code temperature load type.
LOADM_VERTICAL_CRANE_LOAD_BS | 2006 |  The British code vertical crane load type.
LOADM_HORIZONTAL_CRANE_LOAD_BS | 2007 |  The British code horizontal crane load type.
LOADM_DEAD_LOAD_ALONE_AISC | 3001 |  The AISC dead load alone type.
LOADM_DEAD_LOAD_AISC | 3002 |  The AISC dead load type.
LOADM_LIVE_LOAD_AISC | 3003 |  The AISC live load type.
LOADM_ROOF_LIVE_LOAD_AISC | 3004 |  The AISC roof live load type.
LOADM_WIND_LOAD_AISC | 3005 |  The AISC wind load type.
LOADM_SNOW_LOAD_AISC | 3006 |  The AISC snow load type.
LOADM_RAINWATER_LOAD_AISC | 3007 |  The AISC rainwater load type.
LOADM_EARTHQUAKE_LOAD_AISC | 3008 |  The AISC earthquake load type.
LOADM_PERMANENT_LOAD_FR_CM66 | 6001 |  The CM66 permanent load type.
LOADM_EXPLOITATION_LOAD_FR_CM66 | 6002 |  The CM66 exploitation load type.
LOADM_TEMPERATURE_LOAD_FR_CM66 | 6003 |  The CM66 temperature load type.
LOADM_WIND_LOAD_FR_CM66 | 6004 |  The CM66 wind load type.
LOADM_SNOW_LOAD_FR_CM66 | 6005 |  The CM66 snow load type.
LOADM_SEISMIC_LOAD_HORIZONTAL_FR_CM66 | 6006 |  The CM66 seismic load horizontal type.
LOADM_SEISMIC_LOAD_VERTICAL_FR_CM66 | 6007 |  The CM66 seismic load vertical type.
LOADM_PERMANENT_LOAD_FR_BAEL91 | 7001 |  The BAEL91 permanent load type.
LOADM_EXPLOITATION_LOAD_FR_BAEL91 | 7002 |  The BAEL91 exploitation load type.
LOADM_TEMPERATURE_LOAD_FR_BAEL91 | 7003 |  The BAEL91 temperature load type.
LOADM_WIND_LOAD_FR_BAEL91 | 7004 |  The BAEL91 wind load type.
LOADM_SNOW_LOAD_FR_BAEL91 | 7005 |  The BAEL91 snow load type.
LOADM_SEISMIC_LOAD_FR_BAEL91 | 7006 |  The BAEL91 seismic load type.
LOADM_ACCIDENTAL_LOAD_FR_BAEL91 | 7007 |  The BAEL91 accidental load type.
LOADM_DEAD_LOAD_UBC | 8001 |  The UBC dead load type.
LOADM_LIVE_LOAD_UBC | 8002 |  The UBC live load type.
LOADM_ROOF_LIVE_LOAD_UBC | 8003 |  The UBC roof live load type.
LOADM_WIND_LOAD_UBC | 8004 |  The UBC wind load type.
LOADM_SNOW_LOAD_UBC | 8005 |  The UBC snow load type.
LOADM_TEMPERATURE_LOAD_UBC | 8006 |  The UBC temperature load type.
LOADM_FLUIDS_LOAD_UBC | 8007 |  The UBC fluids load type.
LOADM_SOIL_LOAD_UBC | 8008 |  The UBC soil load type.
LOADM_PONDING_LOAD_UBC | 8009 |  The UBC ponding load type.
LOADM_SEISMIC_LOAD_UBC | 8010 |  The UBC seismic load type.
LOADM_DEAD_LOAD_IBC | 9001 |  The IBC dead load type.
LOADM_LIVE_LOAD_IBC | 9002 |  The IBC live load type.
LOADM_ROOF_LIVE_LOAD_IBC | 9003 |  The IBC roof live load type.
LOADM_WIND_LOAD_IBC | 9004 |  The IBC wind load type.
LOADM_SNOW_LOAD_IBC | 9005 |  The IBC snow load type.
LOADM_TEMPERATURE_LOAD_IBC | 9006 |  The IBC temperature load type.
LOADM_FLUIDS_LOAD_IBC | 9007 |  The IBC fluids load type.
LOADM_SOIL_LOAD_IBC | 9008 |  The IBC soil load type.
LOADM_RAIN_LOAD_IBC | 9009 |  The IBC rain load type.
LOADM_PONDING_LOAD_IBC | 9010 |  The IBC ponding load type.
LOADM_SEISMIC_LOAD_IBC | 9011 |  The IBC seismic load type.
LOADM_DEAD_LOAD_ACI | 9101 |  The ACI dead load type.
LOADM_LIVE_LOAD_ACI | 9102 |  The ACI live load type.
LOADM_ROOF_LIVE_LOAD_ACI | 9103 |  The ACI roof live load type.
LOADM_WIND_LOAD_ACI | 9104 |  The ACI wind load type.
LOADM_SEISMIC_LOAD_ACI | 9105 |  The ACI seismic load type.
LOADM_SNOW_LOAD_ACI | 9106 |  The ACI snow load type.
LOADM_FLUIDS_LOAD_ACI | 9107 |  The ACI fluids load type.
LOADM_SOIL_LOAD_ACI | 9108 |  The ACI soil load type.
LOADM_RAIN_LOAD_ACI | 9109 |  The ACI rain load type.
LOADM_TEMPERATURE_LOAD_ACI | 9110 |  The ACI temperature load type.
See Also
Reference
Tekla.Structures.Analysis Namespace